#include <Arduino.h>

#include <Servo.h> // Подключаем стандартную библиотеку для работы с сервоприводами

Servo myServo;  // Создаем объект для управления нашей сервой

void setup() {
  myServo.attach(9); // Говорим Arduino, что сигнальный провод подключен к пину D9
}

void loop() {
  // 1. Плавно поворачиваем вал от 0 до 180 градусов
  for (int angle = 0; angle <= 180; angle++) {
    myServo.write(angle); // Посылаем команду встать в точный градус
    delay(15);            // Задержка определяет скорость вращения
  }

  delay(1000); // Замираем на 1 секунду в крайнем положении

  // 2. Плавно возвращаем вал обратно от 180 до 0 градусов
  for (int angle = 180; angle >= 0; angle--) {
    myServo.write(angle);
    delay(15);
  }

  delay(1000); // Замираем на 1 секунду
}