#include <Arduino.h>

// Объявляем константу для пина. byte занимает всего 1 байт памяти.
// Это гораздо безопаснее, чем просто писать число 2 по всему коду.
const byte LED_PIN = 2; 

void setup() {
  // Настраиваем пин D2 на выход. Теперь он готов выдавать безопасный ток.
  pinMode(LED_PIN, OUTPUT); 
}

void loop() {
  // Подаем 5V на пин D2. Ток пойдет через провод, анод светодиода, 
  // затем через резистор ограничит свою силу и уйдет в GND. Светодиод горит.
  digitalWrite(LED_PIN, HIGH); 
  delay(1000); // Ждем 1 секунду
  
  // Подаем 0V (GND) на пин D2. Тока нет, светодиод гаснет.
  digitalWrite(LED_PIN, LOW);  
  delay(1000); // Ждем 1 секунду
}